/* 
 Localizable.strings
 uPic
 
 Created by Svend Jin on 2019/6/8.
 Copyright © 2019 Svend Jin. All rights reserved.
 */


"OK" = "OK";
"Cancel" = "Cancel";
"Yes" = "Yes";
"Warning" = "Warning";
"Continue" = "Continue";
"Example:" = "Example:";
"On" = "On";
"Off" = "Off";
"APP Name" = "APP Name";

/* 成功通知标题 */
"Successfully" = "Successfully";
/* 上传成功通知标题 */
"Uploaded successfully" = "Uploaded successfully";
/* 上传成功通知副标题 */
"URL has been copied to the clipboard, paste and use it!" = "URL has been copied to the clipboard, paste and use it!";
/* 当前上传任务还未完成通知副标题 */
"The current upload task is not complete" = "The current upload task is not complete";
/* 上传失败通知标题 */
"Upload failed" = "Upload failed";
/* 导入图床配置失败标题 */
"Import failed" = "Import failed";
/* 导入图床配置失败内容 */
"The configuration file is invalid, please check!" = "The configuration file is invalid, please check!";
/* 导入图床配置成功内容 */
"The configuration has been imported, please check and use!" = "The configuration has been imported, please check and use!";
/* 导出图床配置失败标题 */
"Export failed" = "Export failed";
/* 导出图床配置失败内容 */
"No exportable hosts!" = "No exportable hosts!";
/* 导出图床配置失败内容2 */
"configuration export error!" = "configuration export error!";
/* 导出图床配置成功内容 */
"The configuration file is exported successfully, Do not modify the file contents!" = "The configuration file is exported successfully, Do not modify the file contents!";

/* 文件不存在或已被删除 */
"The file does not exist or has been deleted!" = "The file does not exist or has been deleted!";
/* 文件格式不支持 */
"File format not supported!" = "File format not supported!";
/* 文件大小超过限制 */
"File is over the size limit! Limit:" = "File is over the size limit! Limit:";
/* 图床配置存在问题, 请检查 */
"There is a problem with the map bed configuration, please check!" = "There is a problem with the map bed configuration, please check!";

/*匿名上传*/
"The file will be uploaded anonymously to" = "The file will be uploaded anonymously to";
"Upload via uPic" = "Upload via uPic";
"Upload selected files via uPic" = "Upload selected files via uPic";
"Right click to cancel the current upload task" = "Right click to cancel the current upload task";

"App is already running" = "uPic is already running!";

"Did not get the file URL" = "Did not get the file URL";

/* 状态栏菜单图床 */
"Host" = "Host";
/* 状态栏菜单输出格式 */
"Output format" = "Output format";
/* 状态栏菜单输出格式编码 */
"Output format encode" = "Output format encode";
/* 状态栏菜单上传前压缩图片 */
"Compress images before uploading" = "Compress images before uploading";

"Reset User Preferences?" = "Reset User Preferences?";
"⚠️ Note that this will reset all user preferences" = "⚠️ Note that this will reset all user preferences";
"Continuing will lose unsaved data. Do you want to continue?" = "Continuing will lose unsaved data. Do you want to continue?";
"Import host configuration" = "Import host configuration";
"⚠️ Please choose import method, merge or overwrite?" = "⚠️ Please choose import method, merge or overwrite?";
"merge" = "merge";
"⚠️ overwrite" = "⚠️ overwrite";

/* host -- start */
"Region" = "Region";
"Endpoint" = "Endpoint";
"Customize" = "Customize";
"Bucket" = "Bucket";
"Operator" = "Operator";
"Password" = "Password";
"Access Key" = "Access Key";
"Secret Id" = "Secret Id";
"Secret Key" = "Secret Key";
"Domain" = "Domain";
"URL suffix" = "URL suffix";
"API URL" = "API URL";
"Method" = "Method";
"File Field" = "File Field";
"URL Path" = "URL Path";
"Bodys" = "Bodys";
"Headers" = "Headers";
"Owner" = "Owner";
"Repo" = "Repo";
"Branch" = "Branch";
"Token" = "Token";
"Username" = "Username";
"Cookie Mode" = "Cookie Mode";
"Cookie" = "Cookie";
"Pic Quality" = "Pic Quality";
"Other fields" = "Other fields";
"Header Data" = "Header Data";
"Body Data" = "Body Data";
"Client ID" = "Client ID";
"Save Key" = "Save Key";
"Use CDN" = "Use jsDelivr CDN to speed up access";
"Version" = "Version";
"Email" = "Email";
"Anonymous" = "Anonymous";
"Use Base64" = "Use Base64";

/* host field placeholder */
"Get API Token" = "Get API Token";
"Get Client ID" = "Get Client ID";
"Never created Client ID" = "Not created yet? Go create!";
"Created Client ID" = "Already created? Go get!";
"Operator name" = "Operator name";
"Operator password" = "Operator password";
"Just the repo name, not the repo URL" = "Just the repo name, not the repo URL";
"domain:https://xxx.com" = "domain:https://xxx.com";
"Can be empty, there is a default domain" = "Can be empty, there is a default domain";
"The path to the URL field in Response JSON" = "The path to the URL field in Response JSON";
"(optional),When filled, URL = domain + URL path value" = "(optional),When filled, URL = domain + URL path value";

"Save Key Tips" = "Supports {year} {month} {day} {hour} {minute} {second} {since_second} {since_millisecond} {random} {filename} {.suffix} {suffix} {mimetype} and etc. For example, the uploaded file is uPic.jpg, set to \"uPic/{filename}{.suffix}\", it will be saved as: uPic/uPic.jpg.";
"Suffix Tips" = "The suffix added during the visit does not affect the upload(also supports variables). Can be used as object storage for image processing styles, etc ... For example: !w means get a watermarked image.";

/*host type*/
"host.type.custom" = "Custom";
"host.type.smms" = "SMMS";
"host.type.qiniu_kodo" = "Qiniu KODO";
"host.type.upyun_uss" = "Upyun USS";
"host.type.aliyun_oss" = "Aliyun OSS";
"host.type.tencent_cos" = "Tencent Cloud COS";
"host.type.github" = "GitHub";
"host.type.gitee" = "Gitee";
"host.type.weibo" = "Weibo";
"host.type.amazon_s3" = "Amazon S3";
"host.type.imgur" = "Imgur";
"host.type.baidu_bos" = "Baidu Cloud BOS";
"host.type.lsky_pro" = "Lsky Pro";
"host.type.minio" = "MinIO";
"host.type.s3" = "Amazon S3(Support for third-party S3 protocols)";

/* weibo quality*/
"weibo.quality.thumbnail" = "thumbnail";
"weibo.quality.mw690" = "medium size";
"weibo.quality.large" = "original";

/* smms version */
"smms.version.v1" = "Anonymous";
"smms.version.v2" = "Paid version (registered user)";

"Validate" = "Validate";

/*eroor message*/
"Upload failed, please check the configuration!" = "Upload failed, please check the configuration!";

/* cli */
"Path and URL of the file to upload" = "Path and URL of the file to upload (At least one, separated by a space)";
"Output url format" = "Output url format, support url, html, markdown (md), ubb";
"Turn off error message output" = "Turn off error message output, and output the original file path after the file upload fails";
"Print this help message" = "Print this help message";

/* cli error msg */
"Invalid file path" = "Invalid file path or url";
"Total paths count" = "Total of {count} file paths and urls";
